
// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Clover_title" = "Clover EFI";
"Clover_description" = "Clover EFI benötigt 3 wichtige Dateien.
boot0 (Für MBR der Festplatte) ladet boot1.
boot1 (Für den Startbereich der Partition) sucht nach boot2.
boot2 (Für das Root Verzeichniss der Partition) ladet /EFI/BOOT/CLOVERIA32.efi oder CLOVERX64.efi, und den Kernel etc.";

"boot0_title" = "1. BIOS MBR boot0 (HFS+Fat32)";
"boot0_description" = "Zum BIOS booten eines  Computers.
Mit fdisk440 wird boot0 in den ersten 440 Bits der MBR installiert, ohne eine eventuell vorhandene Windows Partition zu zerstören, boot0 sucht dann auf der ersten aktiven HFS Partition nach boot1h2,oder auf der ersten aktiven FAT32 Partition nach boot1f32alt. 
Bei dieser Option werden die HFS+ und FAT32 Partition aktiviert.
Dazu muss zuerst wie folgend in FAT32 formatiert werden ( x = die Festplatte auf der installiert werden soll ).
  1. zuerst MS-DOS (FAT) mit dem Festplattendienstprogramm löschen
  2. diskutil list
  3. diskutil unmount /dev/rdiskxs1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdiskxs1
  5. diskutil mount /dev/rdiskxs1";

"boot0hfs_title" = "1. BIOS MBR boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "Zum BIOS booten eines  Computers.
Mit fdisk440 wird boot0hfs in den ersten 440 Bits der MBR installiert, ohne eine eventuell vorhandene Windows Partition zu zerstören, boot0 sucht dann auf der ersten aktiven HFS Partition nach boot1h2,oder auf der ersten aktiven FAT32 Partition nach boot1f32alt.
Diese Option wird nicht die gewählte HFS Partition , sondern die gewählte FAT32 Partition, aktivieren.
Dazu muss zuerst wie folgend in FAT32 formatiert werden ( x = die Festplatte auf der installiert werden soll ).
  1. zuerst MS-DOS (FAT) mit dem Festplattendienstprogramm löschen
  2. diskutil list
  3. diskutil unmount /dev/rdisxs1
  4. newfs_msdos -v Fat32 -F 32 /dev/rdiskxs1
  5. diskutil mount /dev/rdiskxs1";

"boot0hfsEFI_title" = "1. BIOS GPT EFI (HFS+Fat32)";
"boot0hfsEFI_description" = "Zum BIOS booten eines  Computers.
Mit fdisk440 wird boot0hfs in den ersten 440 Bits der MBR installiert, ohne eine eventuell vorhandene Windows Partition zu zerstören, boot0 sucht dann auf der ersten GPT/EFI Partition nach boot1h2 oder boot1f32alt.
Diese Option aktiviert nicht die ausgewählte Partition
EFI muss zuerst auf folgende Art in HFS+ formatiert wertden.
  1. diskutil list
  2. newfs_hfs -v EFI /dev/rdiskxs1
oder formatiere EFI in Fat32 
  1. diskutil list
  2. newfs_msdos -v EFI -F 32 /dev/rdisk9s1";

"boot1no_title" = "1. Nur entpacken";
"boot1no_description" = "Zum BIOS booten eines  Computers.
Nichts wird installiert: boot0 , boot0hfs, boot0md, boot1h2 und boot1f32alt, für manuelle Installation auf 4KB HDD.";

"boot1UEFI_title" = "1. UEFI booten";
"boot1UEFI_description" = "Zum booten eines UEFI Computers
Nichts wird installiert: boot0 , boot0hfs, boot0md, boot1h2, und boot1f32alt.
Diese Option installiert einige Treiber in /EFI/drivers32, /EFI/drivers64 und /EFI/drivers64UEFI um UEFI zu starten.
Es muss UEFI Konfiguration gewählt sein (Im Bios oder in der Shell) :
UEFI -> /EFI/BOOT/CloverX64.efi -> boot.efi -> OS X";

"boot32_title" = "2. Installiere und boote 32Bit zuerst";
"boot32_description" = "Installiert die boot Dateien und startet zuerst im 32Bit Modus.
Standard Bootablauf = Clover EFI 32Bit. Du kannst wählen zwischen...
Drücke Taste 1 für boot1 = Chameleon boot,
Drücke Taste 3 für boot3 = Clover EFI 32Bit boot,
Drücke Taste 6 für boot6 = Clover EFI 64Bit boot.";

"boot64_title" = "2. Installiere und boote 64Bit zuerst";
"boot64_description" = "Installiert die boot Dateien und startet zuerst im 64Bit Modus.
Standard Bootablauf = Clover EFI 64Bit. Du kannst wählen zwischen...
Drücke Taste 1 für boot1 = Chameleon boot,
Drücke Taste 3 für boot3 = Clover EFI 32Bit boot,
Drücke Taste 6 für boot6 = Clover EFI 64Bit boot.";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "Themen";
"Themes_description" = "Themen Auswahl.";

"black_green_title" = "black_green";
"black_green_description" = "Thema black_green von Blackosx,
Wird installiert in /EFI/BOOT/themes/black_green.";

"AppleStyle_title" = "AppleStyle";
"AppleStyle_description" = "AppleStyle theme von Eps,
Wird installiert in /EFI/BOOT/themes/AppleStyle.";

"mrengles_title" = "mrengles";
"mrengles_description" = "mrengles theme von mrengles,
Wird installiert in /EFI/BOOT/themes/mrengles.";

"buttons_title" = "buttons";
"buttons_description" = "hema Buttons von Trauma,
Wird installiert in /EFI/BOOT/themes/buttons.";

"hellfire_title" = "hellfire";
"hellfire_description" = "Thema Hellfire von illevelll,
Wird installiert in /EFI/BOOT/themes/hellfire.";

"metal_title" = "metal";
"metal_description" = "Orginal Thema metal von Slice,
Wird installiert in /EFI/BOOT/themes/metal.";

"simple_gray_title" = "simple_gray";
"simple_gray_description" = "Thema Simple_gray von hijeane,
Wird installiert in /EFI/BOOT/themes/simple_gray.";

"wooden_title" = "wooden";
"wooden_description" = "Thema Wooden von iROOTa,
Wird installiert in /EFI/BOOT/themes/wooden.";

// ----------------------------------------------------------------------------